Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [6]:
#Ans_1.
import pandas as pd
data = [4,8,15,16,23,42]
series = pd.Series(data)
print(series)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it.

In [10]:
#Ans_2.
lst = [1,2,3,4,5,6,7,8,9]

In [11]:
len(var)

10

In [12]:
series = pd.Series(lst)
print(series)

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
8    9
dtype: int64

Q3. Create a Pandas DataFrame that contains the following data:
Name
Alice
Bob
Claire

Age
25
30
27

Gender
Female
Male
Female

In [15]:
#Ans_3.
data1 = {"Name": ["Alice", "Bob", "Claire"],
    "Age": [25, 30, 27],
    "Gender": ["Female", "Male", "Female"]}
pd.DataFrame(data1)

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [17]:
dataframe = pd.DataFrame(data1)
print(dataframe)

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

#Ans_4.
DATA FRAME :- A Pandas DataFrame is a 2 dimensional data structure, like a 2 dimensional array, or a table with rows and columns.

Difference:- 
* A Series is one-dimensional and represents a single column of data with labels, while a DataFrame is two-dimensional and represents a table-like structure with multiple columns, where each column can be a Series.

* A Series has only one axis (index), while a DataFrame has two axes (index and columns).

In [18]:
#example:- Data Frame
data1 = {"Name": ["Alice", "Bob", "Claire"],
    "Age": [25, 30, 27],
    "Gender": ["Female", "Male", "Female"]}
pd.DataFrame(data1)

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [19]:
#example:- Series
data = [4,8,15,16,23,42]
series = pd.Series(data)
print(series)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?

In [27]:
#Ans_5.
data2 = {"Name": ["Alice", "Bob", "Claire", "Jack", "Jill", "Masimo"],
    "Age": [25, 30, 27, 45, 77, 85],
    "Gender": ["Female", "Male", "Female", "Male",  "Male",  "Male"]}
main_data = pd.DataFrame(data2)

In [29]:
#Example:-
main_data.to_csv("Data2.csv", index= False)

In [31]:
#Example:-
df = pd.read_csv("Data2.csv")

In [32]:
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female
3    Jack   45    Male
4    Jill   77    Male
5  Masimo   85    Male

In [34]:
df.head(2)

    Name  Age  Gender
0  Alice   25  Female
1    Bob   30    Male

In [36]:
df.tail(2)

     Name  Age Gender
4    Jill   77   Male
5  Masimo   85   Male

In [37]:
df.columns

Index(['Name', 'Age', 'Gender'], dtype='object')

In [38]:
type(df)

pandas.core.frame.DataFrame

In [41]:
df.dtypes

Name      object
Age        int64
Gender    object
dtype: object

In [43]:
df[['Age', 'Gender']]

   Age  Gender
0   25  Female
1   30    Male
2   27  Female
3   45    Male
4   77    Male
5   85    Male

Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

#Ans_6.
* Series: A Series is mutable, meaning you can change its values after it's created. You can modify individual elements by indexing and assigning new values.

* DataFrame: A DataFrame is also mutable. You can add, modify, or remove columns and rows after the DataFrame is created. Columns can be reassigned, and rows can be appended or dropped.

* Panel: The panel is a three-dimensional data structure with heterogeneous data. It is very hard to represent the Panel in a graphical representation. But a Panel can be illustrated as a container of a DataFrame. In Panel Data and size are mutable.

Q7. Create a DataFrame using multiple Series. Explain with an example.

In [47]:
#Ans-7.
names = pd.Series(["Alice", "Bob", "Claire", "Jack", "Jill", "Masimo"])
ages = pd.Series([25, 30, 27, 45, 77, 85])
genders = pd.Series(["Female", "Male", "Female", "Male",  "Male",  "Male"])

data3 = {"Name": names,
    "Age": ages,
    "Gender": genders}

pd.DataFrame(data3)

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female
3    Jack   45    Male
4    Jill   77    Male
5  Masimo   85    Male

In [48]:
df1 = pd.DataFrame(data3)

print(df1)

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female
3    Jack   45    Male
4    Jill   77    Male
5  Masimo   85    Male